CSI API ETABS v1

# eConstraintAxis Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eConstraintAxis

    Public Enumeration eConstraintAxis

    Dim instance As eConstraintAxis

    public enum class eConstraintAxis

    type eConstraintAxis

Members

| Member name| Value| Description
---|---|---|---
| X| 1|
| Y| 2|
| Z| 3|
| AutoAxis| 4|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com